<HTML
><HEAD
><TITLE
>Frequently Encountered Error Messages</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.63
"><LINK
REL="HOME"
TITLE="Linux Frequently Asked Questions with Answers"
HREF="index.html"><LINK
REL="PREVIOUS"
TITLE="Miscellaneous Information and Questions Answered"
HREF="x2984.html"><LINK
REL="NEXT"
TITLE="The X Window System"
HREF="x3516.html"></HEAD
><BODY
CLASS="SECT1"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Linux Frequently Asked Questions with Answers</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="x2984.html"
>Prev</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
></TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="x3516.html"
>Next</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECT1"
><H1
CLASS="SECT1"
><A
NAME="AEN3182"
>10. Frequently Encountered Error Messages</A
></H1
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3184"
>10.1. <B
CLASS="COMMAND"
>Modprobe</B
> Can't Locate Module, 
<EM
>XXX</EM
>, and Similar Messages.</A
></H2
><P
>These types of messages mostly occur at boot time or shutdown. If
modprobe, insmod, or rmmod complain about not being able to find a
module, add the following to the <TT
CLASS="FILENAME"
>/etc/modules.conf</TT
> or
<TT
CLASS="FILENAME"
>/etc/modutils/aliases</TT
> 
file, whichever is present on your system.</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>   $ alias &#60;module-name&#62; off</PRE
></TD
></TR
></TABLE
></P
><P
>And use the name of the module that appears in the error message.</P
><P
>[J.H.M. Dassen]</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3195"
>10.2. Unknown Terminal Type ``<TT
CLASS="LITERAL"
>linux</TT
>'' and Similar.</A
></H2
><P
>In early kernels the default console terminal type has changed from
``<TT
CLASS="LITERAL"
>console</TT
>'' to ``<TT
CLASS="LITERAL"
>linux</TT
>.''  You
must edit <TT
CLASS="FILENAME"
>/etc/termcap</TT
> to change the line
reading:</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>   console|con80x25:\</PRE
></TD
></TR
></TABLE
></P
><P
>to</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>   linux|console|con80x25:\</PRE
></TD
></TR
></TABLE
></P
><P
>(there may be an additional ``<TT
CLASS="LITERAL"
>dumb</TT
>'' 
in there&#8212;if so it should be removed.)</P
><P
>To get the editor to work you may need type:</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>   $ TERM=console</PRE
></TD
></TR
></TABLE
></P
><P
>(for <B
CLASS="COMMAND"
>bash</B
> and <B
CLASS="COMMAND"
>ksh</B
>), or</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>   $ setenv TERM console</PRE
></TD
></TR
></TABLE
></P
><P
>for <B
CLASS="COMMAND"
>csh</B
> or <B
CLASS="COMMAND"
>tcsh</B
>.</P
><P
>Some programs use <TT
CLASS="FILENAME"
>/usr/lib/terminfo</TT
> 
instead of <TT
CLASS="FILENAME"
>/etc/termcap</TT
>. For these
programs you should upgrade your terminfo package, 
which is part of ncurses.</P
><P
>The same is true for X terminal displays.  If your distribution
sets the <TT
CLASS="LITERAL"
>TERM</TT
> to something strange like
<TT
CLASS="LITERAL"
>xterm-24-color</TT
>, you can simply reset it 
to a generic value from the command line:</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>   $ TERM="xterm"; export TERM</PRE
></TD
></TR
></TABLE
></P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3228"
>10.3. <TT
CLASS="LITERAL"
>INET: Warning: old style ioctl... called!</TT
></A
></H2
><P
>You are trying to use the old network configuration utilities. The new
ones can be found on 
<A
HREF="ftp.linux.org.uk/pub/linux/Networking/PROGRAMS/NetTools/"
TARGET="_top"
><TT
CLASS="LITERAL"
>ftp.linux.org.uk/pub/linux/Networking/PROGRAMS/NetTools/</TT
></A
> (source only, I'm afraid).</P
><P
>Note that they cannot be used just like the old-style programs. See
the <I
CLASS="CITETITLE"
>NET-2 HOWTO</I
> for instructions on how to set
up the old-style networking programs correctly. Even better, see the
<I
CLASS="CITETITLE"
>NET-3 HOWTO</I
> and upgrade your networking
software.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3237"
>10.4. <TT
CLASS="LITERAL"
>ld: unrecognized option '-m486'</TT
></A
></H2
><P
>You have an old version of <B
CLASS="COMMAND"
>ld</B
>. 
Install a newer binutils package that 
contains an updated <B
CLASS="COMMAND"
>ld</B
>. Look on tsx-11.mit.edu in
<TT
CLASS="FILENAME"
>/pub/linux/packages/GCC/</TT
> for 
<TT
CLASS="FILENAME"
>binutils-2.6.0.2.bin.tar.gz</TT
>.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3245"
>10.5. GCC Says, ``<TT
CLASS="LITERAL"
>Internal compiler error</TT
>.''</A
></H2
><P
>If the fault is repeatable (i.e., it always happens at the same place
in the same file&#8212;even after rebooting and trying again, using a
stable kernel) you have discovered a bug in GCC. See the GCC Info
documentation (type
<B
CLASS="KEYCAP"
>F1</B
>-<B
CLASS="KEYCAP"
>i</B
> in Emacs,
and select GCC from the menu) for details on how to report the
error.  Make sure you have the latest version, though.</P
><P
>Note that this is probably not a Linux-specific problem. Unless you
are compiling a program many other Linux users also compile, you
should not post your bug report to any of the comp.os.linux groups.</P
><P
>If the problem is not repeatable, you may be experiencing memory
corruption.  Refer to the answer:
(``<A
HREF="x3182.html#AEN3255"
><I
>Make Says, ``<I
>Error 139.</I
>''</I
></A
>'')</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3255"
>10.6. Make Says, ``<TT
CLASS="LITERAL"
>Error 139.</TT
>''</A
></H2
><P
>Your compiler (GCC) dumped core. You probably have a corrupted, buggy,
or old version of GCC&#8212;get the latest release or EGCS. Alternatively,
you may be running out of swap space.  Refer to:
(``<A
HREF="x1973.html#AEN2128"
><I
>The Machine Runs Very Slowly with GCC / X / ...</I
></A
>'')</P
><P
>If this doesn't fix the problem, you are probably having problems with
memory or disk corruption. Check that the clock rate, wait states, and
refresh timing for your SIMMS and cache are correct (hardware manuals
are sometimes wrong, too). If so, you may have some marginal SIMMS, or
a faulty motherboard or hard disk or controller.</P
><P
>Linux is a very good memory tester&#8212;much better than MS-DOS based
memory test programs.</P
><P
>Reportedly, some clone x87 math coprocessors can cause problems. Try
compiling a kernel with math emulation 
(``<A
HREF="x2406.html#AEN2845"
><I
>How To Upgrade/Recompile a Kernel.</I
></A
>'')
<TT
CLASS="LITERAL"
>no387</TT
>
kernel command line flag on the LILO prompt to force the kernel to use
math emulation, or it may be able to work and still use the '387, with
the math emulation compiled in but mainly unused.</P
><P
>More information about this problem is available on the Web at
<A
HREF="http://www.bitwizard.nl/sig11/"
TARGET="_top"
><TT
CLASS="LITERAL"
>http://www.bitwizard.nl/sig11/</TT
></A
>.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3268"
>10.7. Shell-Init: Permission Denied when I Log In.</A
></H2
><P
>Your root directory and all the directories up to your home directory
must be readable and executable by everybody. See the manual page for
<B
CLASS="COMMAND"
>chmod</B
> or a book on Unix for how to fix the problem.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3272"
>10.8. No Utmp Entry. You Must Exec ... when Logging In.</A
></H2
><P
>Your <TT
CLASS="FILENAME"
>/var/run/utmp</TT
> is screwed up. You should have</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>   /var/run/utmp</PRE
></TD
></TR
></TABLE
></P
><P
>in your <TT
CLASS="FILENAME"
>/etc/rc.local</TT
> or 
<TT
CLASS="FILENAME"
>/etc/rc.d/*</TT
>. See, 
(``<A
HREF="x1973.html#AEN2216"
><I
>I Screwed Up the System and Can't Log In to Fix It.</I
></A
>'')  Note that the 
<TT
CLASS="FILENAME"
>utmp</TT
> may also
be found in <TT
CLASS="FILENAME"
>/var/adm/</TT
> or 
<TT
CLASS="FILENAME"
>/etc/</TT
> on some older systems.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3285"
>10.9. Warning--bdflush Not Running.</A
></H2
><P
>Modern kernels use a better strategy for writing cached disk blocks.
In addition to the kernel changes, this involves replacing the old

<B
CLASS="COMMAND"
>update</B
> program which used to write everything every
30 seconds with a more subtle daemon (actually a pair), known as
<B
CLASS="COMMAND"
>bdflush</B
>.  Get
<TT
CLASS="FILENAME"
>bdflush-</TT
><EM
>n.n</EM
><TT
CLASS="FILENAME"
>.tar.gz</TT
>
from the same place as the kernel source code (``<A
HREF="x2406.html#AEN2845"
><I
>How To Upgrade/Recompile a Kernel.</I
></A
>'') and compile and install
it. <B
CLASS="COMMAND"
>bdflush</B
> should be started before the usual
boot-time file system checks. It will work fine with older kernels as
well, so there's no need to keep the old <B
CLASS="COMMAND"
>update</B
>
around.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3296"
>10.10. <TT
CLASS="LITERAL"
>Warning: obsolete routing request made</TT
>.</A
></H2
><P
>This is nothing to worry about. The message means that your version
<B
CLASS="COMMAND"
>route</B
> is a little out of date, compared to the
kernel.  You can make the message go away by getting a new version of
<B
CLASS="COMMAND"
>route</B
> from the same place as the kernel source
code.  (``<A
HREF="x2406.html#AEN2845"
><I
>How To Upgrade/Recompile a Kernel.</I
></A
>'')</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3303"
>10.11. <TT
CLASS="LITERAL"
>EXT2-fs: warning: mounting unchecked file system</TT
>.</A
></H2
><P
>You need to run <B
CLASS="COMMAND"
>e2fsck</B
> (or <TT
CLASS="LITERAL"
>fsck -t
ext2</TT
> if you have the <B
CLASS="COMMAND"
>fsck</B
> front end
program) with the <B
CLASS="COMMAND"
>-a</B
> option to get it to clear the
``<TT
CLASS="LITERAL"
>dirty</TT
>'' flag, and then cleanly unmount the
partition during each shutdown.</P
><P
>The easiest way to do this is to get the latest
<B
CLASS="COMMAND"
>fsck</B
>, <B
CLASS="COMMAND"
>umount</B
>, and
<B
CLASS="COMMAND"
>shutdown</B
> commands, available in Rik Faith's
<TT
CLASS="FILENAME"
>util-linux</TT
> package (``<A
HREF="x346.html#AEN881"
><I
>Where Are the Linux FTP Archives?</I
></A
>'') You have to make sure that
your <TT
CLASS="FILENAME"
>/etc/rc*/</TT
> scripts use them correctly.</P
><P
>NB: Don't try to check a file system that's mounted read/write.  This
includes the root partition if you don't see</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>   VFS: mounted root ... read-only</PRE
></TD
></TR
></TABLE
></P
><P
>at boot time. You must arrange to mount the root file system read/only
to start with, check it if necessary, and then remount it read/write.
Almost all distributions do this.  If your's doesn't, read the
documentation that comes with <TT
CLASS="FILENAME"
>util-linux</TT
> to find
out how to do this.</P
><P
>Note that you need to specify the <B
CLASS="COMMAND"
>-n</B
> option to
<B
CLASS="COMMAND"
>mount</B
> so it won't try to update
<TT
CLASS="FILENAME"
>/etc/mtab</TT
>, since the root file system is still
read-only, and this will otherwise cause it to fail.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3328"
>10.12. <TT
CLASS="LITERAL"
>EXT2-fs warning: maximal count reached</TT
>.</A
></H2
><P
>This message is issued by the kernel when it mounts a file system
that's marked as clean, but whose "number of mounts since check"
counter has reached the predefined value. The solution is to get the
latest version of the ext2fs utilities
(<TT
CLASS="FILENAME"
>e2fsprogs-0.5b.tar.gz</TT
> at the time of writing)
from the usual sites.  (``<A
HREF="x346.html#AEN881"
><I
>Where Are the Linux FTP Archives?</I
></A
>'')</P
><P
>The maximal number of mounts value can be examined and changed using
the <B
CLASS="COMMAND"
>tune2fs</B
> program from this package.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3336"
>10.13. <TT
CLASS="LITERAL"
>EXT2-fs warning: checktime reached</TT
>.</A
></H2
><P
>Kernels from 1.0 onwards support checking a file system based on the
elapsed time since the last check as well as by the number of mounts.
Get the latest version of the ext2fs utilities. 
(``<A
HREF="x3182.html#AEN3328"
><I
><I
>EXT2-fs warning: maximal count reached</I
>.</I
></A
>'')</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3341"
>10.14. <B
CLASS="COMMAND"
>df</B
> Says, 
``<TT
CLASS="LITERAL"
>Cannot read table of mounted file systems</TT
>.''</A
></H2
><P
>There is probably something wrong with your 
<TT
CLASS="FILENAME"
>/etc/mtab</TT
> or <TT
CLASS="FILENAME"
>/etc/fstab</TT
>
files. If you have a reasonably new version of mount, 
<TT
CLASS="FILENAME"
>/etc/mtab</TT
> should
be emptied or deleted at boot time (in 
<TT
CLASS="FILENAME"
>/etc/rc.local</TT
> or <TT
CLASS="FILENAME"
>/etc/rc.d/*</TT
>),
using something like</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>   $ rm -f /etc/mtab*</PRE
></TD
></TR
></TABLE
></P
><P
>Some old Linux distributions have an entry for the root partition in 
<TT
CLASS="FILENAME"
>/etc/mtab</TT
>
made in <TT
CLASS="FILENAME"
>/etc/rc*</TT
> by using <B
CLASS="COMMAND"
>rdev</B
>. 
That is incorrect&#8212;the newer versions
of <B
CLASS="COMMAND"
>mount</B
> do this automatically.</P
><P
>Some old distributions also have a line in 
<TT
CLASS="FILENAME"
>/etc/fstab</TT
> that looks like:</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>   /dev/sdb1   /root   ext2   defaults</PRE
></TD
></TR
></TABLE
></P
><P
>The entry for <TT
CLASS="FILENAME"
>/root</TT
> should read simply 
<TT
CLASS="FILENAME"
>/</TT
>.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3365"
>10.15. <B
CLASS="COMMAND"
>fdisk</B
> Says, 
``<TT
CLASS="LITERAL"
>Partition X has different physical/logical...</TT
>''</A
></H2
><P
>If the partition number (X, above) is 1, this is the same problem as
in <TT
CLASS="LITERAL"
>fdisk: Partition 1 does not start on cylinder boundary</TT
>.

If the partition begins or ends on a cylinder numbered greater than
1024, this is because the standard DOS disk geometry information
format in the partition table can't cope with cylinder numbers with
more than 10 bits. You should see 
(``<A
HREF="x1459.html#AEN1461"
><I
>How To Get Linux to Work with a Disk.</I
></A
>'')</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3372"
>10.16. <TT
CLASS="LITERAL"
>fdisk: Partition 1 does not start on cylinder boundary</TT
>.</A
></H2
><P
>The version of <B
CLASS="COMMAND"
>fdisk</B
> that comes with many Linux
systems creates partitions that fail its own validity
checking. Unfortunately, if you've already installed your system,
there's not much you can do about this, apart from copying the data
off the partition, deleting and remaking it, and copying the data
back.</P
><P
>You can avoid the problem by getting the latest version of
<B
CLASS="COMMAND"
>fdisk</B
>, from Rik Faith's util-linux package
(available on all the usual FTP sites).  Alternatively, if you are
creating a new partition 1 that starts in the first cylinder, you can
do the following to get a partition that <B
CLASS="COMMAND"
>fdisk</B
>
likes.</P
><P
></P
><UL
><LI
><P
>Create partition 1 in the normal way. A `<TT
CLASS="LITERAL"
>p</TT
>' 
listing will produce the mismatch complaint.</P
></LI
><LI
><P
>Type <B
CLASS="KEYCAP"
>u</B
> to set sector mode and do 
<B
CLASS="KEYCAP"
>p</B
> again. Copy down the number
from the <TT
CLASS="LITERAL"
>End</TT
> column.</P
></LI
><LI
><P
>Delete partition 1.</P
></LI
><LI
><P
>While still in sector mode, re-create partition 1. Set the first
sector to match the number of sectors per track. This is the
sector number in the first line of the <B
CLASS="KEYCAP"
>p</B
> 
output. Set the last sector to the value you wrote down in the step above.</P
></LI
><LI
><P
>Type <B
CLASS="KEYCAP"
>u</B
> to reset cylinder mode and continue with other
partitions.</P
></LI
></UL
><P
>    
Ignore the message about unallocated sectors.  They refer to the
sectors on the first track apart from the Master Boot Record, and they
are not used if you start the first partition in track 2.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3398"
>10.17. <B
CLASS="COMMAND"
>fdisk</B
> Says Partition <EM
>n</EM
> Has 
an Odd Number of Sectors.</A
></H2
><P
>The PC disk partitioning scheme works in 512-byte sectors, but Linux
uses 1K blocks. If you have a partition with an odd number of sectors,
the last sector is wasted. Ignore the message.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3403"
>10.18. A Mtools Utility Says It Cannot Initialize Drive <EM
>XYZ</EM
>.</A
></H2
><P
>This means that mtools is having trouble accessing the drive. This can
be due to several things.</P
><P
>Often this is due to the permissions on floppy drive devices
(<TT
CLASS="FILENAME"
>/dev/fd0*</TT
> and <TT
CLASS="FILENAME"
>/dev/fd1*</TT
>) 
being incorrect.  The user running mtools
must have the appropriate access. See the manual page for 
<B
CLASS="COMMAND"
>chmod</B
> for
details.</P
><P
>Most versions of mtools distributed with Linux systems (not the
standard GNU version) use the contents of a file 
<TT
CLASS="FILENAME"
>/etc/mtools</TT
> to
determine which devices and densities to use, in place of having this
information compiled into the binary. Mistakes in this file often
cause problems. There is often no documentation about this.</P
><P
>For the easiest way to access your MS-DOS files (especially those on a
hard disk partition) see How do I access files on my DOS
partition or floppy? Note&#8212;you should never use mtools to access files
on an msdosfs mounted partition or disk!</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3414"
>10.19. At the Start of Booting: <TT
CLASS="LITERAL"
>Memory tight</TT
></A
></H2
><P
>This means that you have an extra-large kernel, which means that Linux
has to do some special memory-management magic to be able to boot
itself from the BIOS. It isn't related to the amount of physical
memory in your machine. Ignore the message, or compile a kernel
containing only the drivers and features you need. 
(``<A
HREF="x2406.html#AEN2845"
><I
>How To Upgrade/Recompile a Kernel.</I
></A
>'')</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3419"
>10.20. My Syslog says, ``<TT
CLASS="LITERAL"
>end_request: I/O error</TT
>, ....''</A
></H2
><P
>This error message, and messages like it, almost always indicate a
hardware error with a hard drive.</P
><P
>This commonly indicates a hard drive defect. The only way to avoid
further data loss is to completely shut own the system. You must also
make sure that whatever data is on the drive is backed up, and restore
it to a non-defective hard drive.</P
><P
>This error message may also indicate a bad connection to the drive,
especially with home brew systems. If you install an IDE drive, 
<EM
>always</EM
>
use new ribbon cables. It's probably is a good idea with SCSI drives, too.</P
><P
>In one instance, this error also seemed to coincide with a bad ground
between the system board and the chassis. Be sure that all electrical
connections are clean and tight before placing the blame on the hard
drive itself.</P
><P
>[Peter Moulder, Theodore Ts'o]</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3428"
>10.21. ``<TT
CLASS="LITERAL"
>You don't exist. Go away.</TT
>''</A
></H2
><P
>This is not a viral infection. It comes from programs like 
<B
CLASS="COMMAND"
>write</B
>, <B
CLASS="COMMAND"
>talk</B
>, and 
<B
CLASS="COMMAND"
>wall</B
>, if your invoking UID doesn't correspond to a valid
user (probably due to <TT
CLASS="FILENAME"
>/etc/passwd</TT
> being corrupted), 
or if the session
(pseudoterminal, specifically) you're using isn't properly registered
in the <TT
CLASS="FILENAME"
>utmp</TT
> file (probably because you invoked 
it in a funny way).</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3437"
>10.22. ``<TT
CLASS="LITERAL"
>Operation not permitted</TT
>.''</A
></H2
><P
>One or more of the file's or directory's attribute bits are set 
incorrectly.  If the ``<TT
CLASS="LITERAL"
>I</TT
>'' bit is set, for
example, you won't be able to change file permissions with 
<B
CLASS="COMMAND"
>chmod</B
>.</P
><P
>The solution is to use <B
CLASS="COMMAND"
>lsattr</B
> to display file and
directory attributes, and <B
CLASS="COMMAND"
>chattr</B
> to set and unset
them.  The programs' documentation is contained in their manual pages.</P
><P
>[Paul Campbell]</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3447"
>10.23. <EM
>programname: </EM
>
<TT
CLASS="LITERAL"
>error in loading shared libraries: lib</TT
>
<EM
>xxx.</EM
><TT
CLASS="LITERAL"
>.so.</TT
>
<EM
>x</EM
><TT
CLASS="LITERAL"
>: cannot open shared object file:
No such file or directory.</TT
></A
></H2
><P
>A message like this, when the program that you're trying to run uses
shared libraries, usually means one of two things: the program was
either compiled on a machine that had a different set of libraries
or library paths than yours; or you've upgraded your libraries 
but not the program.  </P
><P
>Executable programs that are linked with dynamic libraries, expect the
full pathname of each of the library files it requires.  So do the
shared libraries, if they rely on other libraries.  This is so
the shared object dependencies remain as unambiguous as possible, and
also as a security measure.  </P
><P
>Short of recompiling the executable file for the libraries on the
system&#8212;probably the most desirable alternative in the long
run&#8212;you can try to determine which libraries the executable file needs
with the command: ``<TT
CLASS="LITERAL"
>ldd </TT
><EM
>programname</EM
>.''  The output will be a
list of the shared libraries on the system that the program needs to
run, as well as the missing libraries.  You can then add the library
packages, or if the libraries already exist in a different directory,
you can create a symbolic link so the program can find it.  For
example, if the program requires /usr/lib/libncurses.so.2, and your
machine has /lib/libncurses.so.2, you can create a link where the
program expects to find the library; e.g.:</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
># cd /usr/lib &#38;&#38; ln -s /lib/libncurses.so.2 .</PRE
></TD
></TR
></TABLE
></P
><P
>You should note, however, that creating library links like these
should be considered a security risk, and the additional links you
create will not be compatible with future upgrades.  It's simply
a quick fix for backward compatibility.</P
><P
>Also, it may take some guesswork to determine in exactly which of the
system library directories the program expects to find a shared
library file, because <TT
CLASS="LITERAL"
>ldd</TT
> will not list the paths
of libraries it can't find.  A program most likely will tell the
run-time linker, <TT
CLASS="LITERAL"
>/lib/ld.so</TT
>, to look for shared
libraries in <TT
CLASS="FILENAME"
>/lib</TT
>, <TT
CLASS="FILENAME"
>/usr/lib</TT
>,
<TT
CLASS="FILENAME"
>/usr/local/lib</TT
>, or
<TT
CLASS="FILENAME"
>/usr/X11R6/lib</TT
>, if it's an X client.  But that
doesn't mean that libraries can't be installed elsewhere.  It helps to
have some idea of the original library configuration before
proceeding.</P
><P
>Also be sure to run <TT
CLASS="LITERAL"
>ldconfig</TT
> after creating the
symbolic link, so that <TT
CLASS="LITERAL"
>ld.so</TT
> has an updated view
of the system's libraries.  You should also make certain that all of
the library directories are listed in
<TT
CLASS="FILENAME"
>/etc/ld.so.conf</TT
>, and perhaps in the
<TT
CLASS="LITERAL"
>LD_LIBRARY_PATH</TT
> environment variable.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3475"
>10.24. ``<TT
CLASS="LITERAL"
>init: Id "x" respawning too fast: disabled for 5 minutes</TT
>.''</A
></H2
><P
>In most distributions this means that the system is booting by default 
into runlevel 5, which is supposed to respawn (re-start again
after it's been exited) a graphical login via
<SPAN
CLASS="APPLICATION"
>xdm</SPAN
>,
<SPAN
CLASS="APPLICATION"
>kdm</SPAN
>,
<SPAN
CLASS="APPLICATION"
>gdm</SPAN
>, or whatever, 
and the system can't locate the program.</P
><P
>However, ``<TT
CLASS="LITERAL"
>Id</TT
>'' can also indicate the absence 
or misconfiguration of another program, like 
<SPAN
CLASS="APPLICATION"
>mingetty</SPAN
>, if <SPAN
CLASS="APPLICATION"
>init</SPAN
>
tries to respawn itself more than 10 times in 2 minutes.</P
><P
>Id ``x'' is the number in the leftmost column of the 
<TT
CLASS="FILENAME"
>/etc/inittab</TT
> file:</P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>   # Run gettys in standard runlevels
   1:2345:respawn:/sbin/mingetty tty1
   2:2345:respawn:/sbin/mingetty tty2
   3:2345:respawn:/sbin/mingetty tty3
   4:2345:respawn:/sbin/mingetty tty4
   5:2345:respawn:/sbin/mingetty tty5
   6:2345:respawn:/sbin/mingetty tty6</PRE
></TD
></TR
></TABLE
></P
><P
>Commenting the offending line out and then fixing the errant program and
testing on the command line will allow you to see any error messages
that go to standard error output (console) if the errors are not 
going to the system log file. Uncomment the line and restart 
<SPAN
CLASS="APPLICATION"
>init</SPAN
> with 
``<TT
CLASS="LITERAL"
>kill -SIGHUP 1</TT
>'' or 
``<SPAN
CLASS="APPLICATION"
>telinit q</SPAN
>'' to cause 
<SPAN
CLASS="APPLICATION"
>init</SPAN
> to reinitialize and reread the 
<TT
CLASS="FILENAME"
>/etc/inittab</TT
> file.</P
><P
>Some systems, however, rewrite <TT
CLASS="FILENAME"
>/etc/inittab</TT
> when
booting.  In that case, refer to the <TT
CLASS="LITERAL"
>init</TT
> man
page, and/or the settings in <TT
CLASS="FILENAME"
>/etc/sysconfig/init</TT
>.</P
><P
>Refer to the <SPAN
CLASS="APPLICATION"
>init</SPAN
> and 
<TT
CLASS="FILENAME"
>/etc/inittab</TT
> man pages for detailed 
information.</P
><P
>[Carl King]</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="AEN3504"
>10.25. FTP server says: ``421 service not available, remote server has closed connection.''</A
></H2
><P
>If an FTP server won't allow logins, it is probably configured 
correctly, but the problem is probably with authorizing users at login.
FTP servers in current distriubtions often authorize users with the 
Pluggable Authentication Modules library, in which case there should
be an authorization file <TT
CLASS="FILENAME"
>/etc/pam.d/ftp</TT
>.  A 
generic authorization file looks like this. (The line break on the
first ``auth'' line is for readability. The entry is actually a single,
long line).  </P
><P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>   #%PAM-1.0
   auth       required	/lib/security/pam_listfile.so item=user \
	      sense=deny file=/etc/ftpusers onerr=succeed
   auth       required	/lib/security/pam_pwdb.so shadow nullok
   auth       required	/lib/security/pam_shells.so
   account    required	/lib/security/pam_pwdb.so
   session    required	/lib/security/pam_pwdb.so</PRE
></TD
></TR
></TABLE
></P
><P
>Also, make sure the <TT
CLASS="FILENAME"
>/etc/ftpusers</TT
> file, or whatever
users file is named in the first ``auth'' line, is configured correctly.</P
><P
>Btw, the sample <TT
CLASS="FILENAME"
>ftp</TT
> file above is actually
the<TT
CLASS="FILENAME"
>ftpd/ftp.pam.sample</TT
> file from the 
<TT
CLASS="FILENAME"
>ftpd-BSD-0.3.1.tar.gz</TT
> package.  Many thanks
to David A. Madore for this much needed port.</P
></DIV
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="x2984.html"
>Prev</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
>Home</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="x3516.html"
>Next</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>Miscellaneous Information and Questions Answered</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
>&nbsp;</TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>The X Window System</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>